Wstęp do informatyki/wyklad/wstęp do informatyki 01.org
#+title: Wprowadzenie do systemóœ liczbowych
*MACIE OPANOWAC NKB I U2*
wstęp do infrmatyki moodle bez hasłą
* System liczbowy
** System liczbowy o podstawie R: $\R \in N$
Alfabet: $\A = {\hat{a}_1,\hat{a}_2,...,\hat{a}_R}, |A|=R$
$SR \to DEC$:
$x_{DEC} : R = W | Reszta$
$X_{DEC} : R | $W_0$ | $R_{0}$
$X_{0} :R $ | $W_1$ | $R_{1}$
$X_{1} :R $ | $W_2$ | $R_{2}$
$W_{W-2}$ :R | $W_{W-1}$ | $R_{N-1}$
$W_{W-1}$ :R | $0$ | $R_{N}$
$$X_{DEC}=Y_R=(R_R, R_{R-1},...,R_1,R_0)$$

110_{DEC} : 2 = 55| 0
55_{DEC} : 2  = 27| 1
27_{DEC} : 2  = 13| 1
13_{DEC} : 2  = 6| 1
6_{DEC} : 2  = 3| 0
3_{DEC} : 2  = 1| 1
1_{DEC} : 2  = 1| 1

** $SR \to DEC$
$X_{DEC} = \foreach{N}{i=0}a_i*R , a_i \in A$
np:
$lX_{DEC} = 0 * 2^0 + 1 * 2^1 + 1*2^2 + 0 * 2^3 + 0 * 2^4 + 1*2^% + 1*2^6 = 0 + 2 7+ 4 + 8 + 0 + 32 + 64 = 110$$
* Reperezentacja liczb ujemnych
** System ZM (Znak moduł)
   $L_{ZM} = (b_n a_{aN-1}, a_{N-2}, ... , a_{1}, a_0)_{ZM}), a\such \in A, i-a_0,...a_{N-1}$
   $b_N \in {0,1}$ gdzie $b_n=0$ oznacza $L > 0$
   $b_N=1$ oznacza $L < 0$
** System U2 (dopełniniowy do 2)
*** BIN $\to$ DEC
**** U2
$L_{U2}= (a_{N-1+} a_{N-2} ... a_1 a_0)_{U2}$
$U2 \to DEC$
$L_{U2}= a_{N-1}*2^{N-1} + \sum{u-2}{i=0}a_i*2$

$L_{DEC}$
**** MKB
$L_{MKB}= (a_{N-1+} a_{N-2} ... a_1 a_0)_{NKB}$

 $1101110_{U2} = -18$
 $1101110_{NKB} = 110_{DEC}$
*** DEC $\to$ BIN
**** DEC $\to$ NKB
Użyj algorytmu DEC $\to$ SR dla $R=2$
a) Użyj algorytmu DEC $\to$ SR dla $R=2$
$L=(a_{N-1} a_{N-2} ... a_1 a_0)$
b) dodaj "0" do najbardziej znaczącej cyfry
$L_{NKB}=(a_{N-1} a_{N-2} ... a_1 a_0)_{NKB}$
$L_{NKB}=(a_{N-1} a_{N-2} ... a_1 a_0)_{NKB}$
$L_{NKB}= 0 a_{N-1} a_{N-2} ... a_1 a_0$
c) dla $L_{DEC} >= 0$ KONIEC; $dla $L_{DEC} < 0  ?????
$L_{U2}=(B_w b_{w-1} b_{w-2} ... b_1 b_0)_{U2}$

$1101110_{NKB}$
$110_{DEC} = 01101110_{U2}$
$-110_{DEC}=01101110$
100100001
+00000001
---------
$10010010_{U2} = -110_{DEC}$

DEC $\to$ NKB
NKB $\to$ U2
zmiana znaku *L<0*
